package org.qitool.parser.protocol.auto.GBT32960.enums;

/**
 * 应答标志
 * =======================================================================================
 * 命令的主动发起方应答标志为0xFE,表示此包为命令包;当应答标志不是0xFE时,被动接收方应不应答。当命令的被动接收
 * 方应答标志不是0xFE,此包表示为应答包。
 * 当服务端发送应答时,只需变更应答标志,应答报文时间,并重新计算校验位即可,其余报文内容与主动发送报文一致。
 * =======================================================================================
 *
 * @author zoudingyun
 * 2024/5/14 14:59
 */
public enum ResponseFlag {

    /**
     * 0x01
     * 接收到的信息正确
     * */
    SUCCESS("成功"),

    /**
     * 0x02
     * 设置未成功
     * */
    ERROR("错误"),

    /**
     * 0x03
     * VIN重复错误
     * */
    VIN_REPEAT("VIN重复"),

    /**
     * 0xFE
     * <br>
     * -----------------------------------------------------
     * <br>
     * 表示数据包为命令包,而非应答包
     * */
    COMMAND("命令");


    private ResponseFlag(String value){

    }

}
